tiborsimon/embedded-tdd-headers/pic/pic12/pic12f1840_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC12F1840_H_
#define _PIC12F1840_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PIR1                          42
#define TMR1IF                        43
#define TMR2IF                        44
#define CCP1IF                        45
#define SSP1IF                        46
#define TXIF                          47
#define RCIF                          48
#define ADIF                          49
#define TMR1GIF                       50
#define PIR2                          51
#define BCL1IF                        52
#define EEIF                          53
#define C1IF                          54
#define OSFIF                         55
#define TMR0                          56
#define TMR1L                         57
#define TMR1H                         58
#define T1CON                         59
#define TMR1ON                        60
#define nT1SYNC                       61
#define T1OSCEN                       62
#define T1CKPS0                       63
#define T1CKPS                        64
#define T1CKPS1                       65
#define TMR1CS                        66
#define TMR1CS0                       67
#define TMR1CS1                       68
#define T1GCON                        69
#define T1GSS0                        70
#define T1GSS                         71
#define T1GSS1                        72
#define T1GVAL                        73
#define T1GGO_nDONE                   74
#define T1GGO                         75
#define T1GSPM                        76
#define T1GTM                         77
#define T1GPOL                        78
#define TMR1GE                        79
#define TMR2                          80
#define PR2                           81
#define T2CON                         82
#define T2CKPS0                       83
#define T2CKPS                        84
#define T2CKPS1                       85
#define TMR2ON                        86
#define T2OUTPS0                      87
#define T2OUTPS                       88
#define T2OUTPS1                      89
#define T2OUTPS2                      90
#define T2OUTPS3                      91
#define CPSCON0                       92
#define T0XCS                         93
#define CPSOUT                        94
#define CPSRNG                        95
#define CPSRNG0                       96
#define CPSRNG1                       97
#define CPSRM                         98
#define CPSON                         99
#define CPSCON1                       100
#define CPSCH                         101
#define CPSCH0                        102
#define CPSCH1                        103
#define TRISA                         104
#define TRISA0                        105
#define TRISA1                        106
#define TRISA2                        107
#define TRISA3                        108
#define TRISA4                        109
#define TRISA5                        110
#define PIE1                          111
#define TMR1IE                        112
#define TMR2IE                        113
#define CCP1IE                        114
#define SSP1IE                        115
#define TXIE                          116
#define RCIE                          117
#define ADIE                          118
#define TMR1GIE                       119
#define PIE2                          120
#define BCL1IE                        121
#define EEIE                          122
#define C1IE                          123
#define OSFIE                         124
#define OPTION_REG                    125
#define PS                            126
#define PS0                           127
#define PS1                           128
#define PS2                           129
#define PSA                           130
#define T0SE                          131
#define TMR0SE                        132
#define T0CS                          133
#define TMR0CS                        134
#define INTEDG                        135
#define nWPUEN                        136
#define PCON                          137
#define nBOR                          138
#define nPOR                          139
#define nRI                           140
#define nRMCLR                        141
#define STKUNF                        142
#define STKOVF                        143
#define WDTCON                        144
#define SWDTEN                        145
#define WDTPS                         146
#define WDTPS0                        147
#define WDTPS1                        148
#define WDTPS2                        149
#define WDTPS3                        150
#define WDTPS4                        151
#define OSCTUNE                       152
#define TUN0                          153
#define TUN                           154
#define TUN1                          155
#define TUN2                          156
#define TUN3                          157
#define TUN4                          158
#define TUN5                          159
#define OSCCON                        160
#define SCS0                          161
#define SCS                           162
#define SCS1                          163
#define IRCF                          164
#define IRCF0                         165
#define IRCF1                         166
#define IRCF2                         167
#define IRCF3                         168
#define SPLLEN                        169
#define OSCSTAT                       170
#define HFIOFS                        171
#define LFIOFR                        172
#define MFIOFR                        173
#define HFIOFL                        174
#define HFIOFR                        175
#define OSTS                          176
#define PLLR                          177
#define T1OSCR                        178
#define ADRESL                        179
#define ADRESH                        180
#define ADCON0                        181
#define ADON                          182
#define GO_nDONE                      183
#define GO                            184
#define ADGO                          185
#define CHS0                          186
#define CHS                           187
#define CHS1                          188
#define CHS2                          189
#define CHS3                          190
#define CHS4                          191
#define ADCON1                        192
#define ADPREF0                       193
#define ADPREF                        194
#define ADPREF1                       195
#define ADCS0                         196
#define ADCS                          197
#define ADCS1                         198
#define ADCS2                         199
#define ADFM                          200
#define LATA                          201
#define LATA0                         202
#define LATA1                         203
#define LATA2                         204
#define LATA4                         205
#define LATA5                         206
#define CM1CON0                       207
#define C1SYNC                        208
#define C1HYS                         209
#define C1SP                          210
#define C1POL                         211
#define C1OE                          212
#define C1OUT                         213
#define C1ON                          214
#define CM1CON1                       215
#define C1NCH0                        216
#define C1NCH                         217
#define C1PCH                         218
#define C1PCH0                        219
#define C1PCH1                        220
#define C1INTN                        221
#define C1INTP                        222
#define CMOUT                         223
#define MC1OUT                        224
#define BORCON                        225
#define BORRDY                        226
#define BORFS                         227
#define SBOREN                        228
#define FVRCON                        229
#define ADFVR0                        230
#define ADFVR                         231
#define ADFVR1                        232
#define CDAFVR0                       233
#define CDAFVR                        234
#define CDAFVR1                       235
#define TSRNG                         236
#define TSEN                          237
#define FVRRDY                        238
#define FVREN                         239
#define DACCON0                       240
#define DACPSS                        241
#define DACPSS0                       242
#define DACPSS1                       243
#define DACOE                         244
#define DACLPS                        245
#define DACEN                         246
#define DACCON1                       247
#define DACR0                         248
#define DACR                          249
#define DACR1                         250
#define DACR2                         251
#define DACR3                         252
#define DACR4                         253
#define SRCON0                        254
#define SRPR                          255
#define SRPS                          256
#define SRNQEN                        257
#define SRQEN                         258
#define SRCLK0                        259
#define SRCLK                         260
#define SRCLK1                        261
#define SRCLK2                        262
#define SRLEN                         263
#define SRCON1                        264
#define SRRC1E                        265
#define SRRCKE                        266
#define SRRPE                         267
#define SRSC1E                        268
#define SRSCKE                        269
#define SRSPE                         270
#define APFCON                        271
#define CCP1SEL                       272
#define P1BSEL                        273
#define TXCKSEL                       274
#define T1GSEL                        275
#define SSSEL                         276
#define SS1SEL                        277
#define SDO1SEL                       278
#define SDOSEL                        279
#define RXDTSEL                       280
#define ANSA0                         281
#define ANSELA                        282
#define ANSA1                         283
#define ANSA2                         284
#define ANSA4                         285
#define EEADRL                        286
#define EEADRH                        287
#define EEDATL                        288
#define EEDATH                        289
#define EECON1                        290
#define RD                            291
#define WR                            292
#define WREN                          293
#define WRERR                         294
#define FREE                          295
#define LWLO                          296
#define CFGS                          297
#define EEPGD                         298
#define EECON2                        299
#define VREGCON                       300
#define VREGPM0                       301
#define VREGPM                        302
#define VREGPM1                       303
#define RCREG                         304
#define TXREG                         305
#define SP1BRGL                       306
#define SPBRGL                        307
#define SP1BRGH                       308
#define SPBRGH                        309
#define RCSTA                         310
#define RX9D                          311
#define OERR                          312
#define FERR                          313
#define ADDEN                         314
#define CREN                          315
#define SREN                          316
#define RX9                           317
#define SPEN                          318
#define TXSTA                         319
#define TX9D                          320
#define TRMT                          321
#define BRGH                          322
#define SENDB                         323
#define SYNC                          324
#define TXEN                          325
#define TX9                           326
#define CSRC                          327
#define BAUDCON                       328
#define ABDEN                         329
#define WUE                           330
#define BRG16                         331
#define SCKP                          332
#define RCIDL                         333
#define ABDOVF                        334
#define WPUA0                         335
#define WPUA                          336
#define WPUA1                         337
#define WPUA2                         338
#define WPUA3                         339
#define WPUA4                         340
#define WPUA5                         341
#define SSP1BUF                       342
#define SSPBUF                        343
#define SSP1ADD                       344
#define SSPADD                        345
#define SSP1MSK                       346
#define SSPMSK                        347
#define SSP1STAT                      348
#define BF                            349
#define UA                            350
#define R_nW                          351
#define S                             352
#define P                             353
#define D_nA                          354
#define CKE                           355
#define SMP                           356
#define SSP1CON1                      357
#define SSPM0                         358
#define SSPM                          359
#define SSPM1                         360
#define SSPM2                         361
#define SSPM3                         362
#define CKP                           363
#define SSPEN                         364
#define SSPOV                         365
#define WCOL                          366
#define SSP1CON2                      367
#define SEN                           368
#define RSEN                          369
#define PEN                           370
#define RCEN                          371
#define ACKEN                         372
#define ACKDT                         373
#define ACKSTAT                       374
#define GCEN                          375
#define SSP1CON3                      376
#define DHEN                          377
#define AHEN                          378
#define SBCDE                         379
#define SDAHT                         380
#define BOEN                          381
#define SCIE                          382
#define PCIE                          383
#define ACKTIM                        384
#define CCPR1L                        385
#define CCPR1H                        386
#define CCP1CON                       387
#define CCP1M0                        388
#define CCP1M                         389
#define CCP1M1                        390
#define CCP1M2                        391
#define CCP1M3                        392
#define DC1B                          393
#define DC1B0                         394
#define DC1B1                         395
#define P1M                           396
#define P1M0                          397
#define P1M1                          398
#define PWM1CON                       399
#define P1DC                          400
#define P1DC0                         401
#define P1DC1                         402
#define P1DC2                         403
#define P1DC3                         404
#define P1DC4                         405
#define P1DC5                         406
#define P1DC6                         407
#define P1RSEN                        408
#define PSS1BD                        409
#define PSS1BD0                       410
#define PSS1BD1                       411
#define PSS1AC                        412
#define PSS1AC0                       413
#define PSS1AC1                       414
#define CCP1AS                        415
#define CCP1AS0                       416
#define CCP1AS1                       417
#define CCP1AS2                       418
#define CCP1ASE                       419
#define PSTR1CON                      420
#define STR1A                         421
#define STR1B                         422
#define STR1SYNC                      423
#define IOCAP                         424
#define IOCAP0                        425
#define IOCAP1                        426
#define IOCAP2                        427
#define IOCAP3                        428
#define IOCAP4                        429
#define IOCAP5                        430
#define IOCAN0                        431
#define IOCAN                         432
#define IOCAN1                        433
#define IOCAN2                        434
#define IOCAN3                        435
#define IOCAN4                        436
#define IOCAN5                        437
#define IOCAF0                        438
#define IOCAF                         439
#define IOCAF1                        440
#define IOCAF2                        441
#define IOCAF3                        442
#define IOCAF4                        443
#define IOCAF5                        444
#define CLKRCON                       445
#define CLKRDIV                       446
#define CLKRDIV0                      447
#define CLKRDIV1                      448
#define CLKRDIV2                      449
#define CLKRDC                        450
#define CLKRDC0                       451
#define CLKRDC1                       452
#define CLKRSLR                       453
#define CLKROE                        454
#define CLKREN                        455
#define MDCON                         456
#define MDBIT                         457
#define MDOUT                         458
#define MDOPOL                        459
#define MDSLR                         460
#define MDOE                          461
#define MDEN                          462
#define MDSRC                         463
#define MDMS0                         464
#define MDMS                          465
#define MDMS1                         466
#define MDMS2                         467
#define MDMS3                         468
#define MDMSODIS                      469
#define MDCARL                        470
#define MDCL0                         471
#define MDCL                          472
#define MDCL1                         473
#define MDCL2                         474
#define MDCL3                         475
#define MDCLSYNC                      476
#define MDCLPOL                       477
#define MDCLODIS                      478
#define MDCARH                        479
#define MDCH                          480
#define MDCH0                         481
#define MDCH1                         482
#define MDCH2                         483
#define MDCH3                         484
#define MDCHSYNC                      485
#define MDCHPOL                       486
#define MDCHODIS                      487
#define STATUS_SHAD                   488
#define C_SHAD                        489
#define DC_SHAD                       490
#define Z_SHAD                        491
#define WREG_SHAD                     492
#define BSR_SHAD                      493
#define PCLATH_SHAD                   494
#define FSR0L_SHAD                    495
#define FSR0H_SHAD                    496
#define FSR1L_SHAD                    497
#define FSR1H_SHAD                    498
#define STKPTR                        499
#define TOSL                          500
#define TOSH                          501

#endif // _PIC12F1840_H_
